app/workers/confirmation_mailer_worker.rb

    def perform(user_id)
      user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]