app/controllers/home_controller.rb

  def index
    if user_signed_in?
      @users = User.paginate(page: params[:page])
---
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]