app/controllers/home_controller.rb

  def index
    @q = User.ransack(params[:q])
    @users = @q.result(distinct: true).paginate(page: params[:page], per_page: 10).includes([:profile])

    if params[:q] && params[:q][:confirmed_at_eq].present?
      confirmed_status = params[:q][:confirmed_at_eq] == 'true'
      @users = @users.where(confirmed_status ? 'confirmed_at IS NOT NULL' : 'confirmed_at IS NULL')
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["user_id", 4], ["user_id", 5], ["user_id", 6], ["user_id", 7], ["user_id", 8], ["user_id", 9], ["user_id", 10], ["user_id", 11], ["user_id", 12], ["user_id", 13]]
SELECT COUNT(DISTINCT "users"."id") FROM "users" WHERE (confirmed_at IS NOT NULL)
SELECT DISTINCT "users".* FROM "users"

    def user_table_data
      [['Avatar', 'Email', 'Name', 'Address', 'Confirmed At']] + @users.map { |user| [ user.email,  user.profile && user.profile.name ? user.profile.name : 'X', user.profile && user.profile.address ? user.profile.address : 'X' , user.confirmed_at ? user.confirmed_at.to_s : 'X'] }
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["user_id", 4], ["user_id", 5], ["user_id", 6], ["user_id", 7], ["user_id", 8], ["user_id", 9], ["user_id", 10], ["user_id", 11], ["user_id", 12], ["user_id", 13]]