app/controllers/profile_controller.rb

UPDATE "users" SET "updated_at" = ?, "phone" = ?, "address" = ?, "name" = ? WHERE "users"."id" = ?  [["updated_at", "2024-01-24 07:32:23.560856"], ["phone", "2121212121212"], ["address", "12211212"], ["name", "1212121212"], ["id", 4]]
UPDATE "profiles" SET "gender" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["gender", 0], ["updated_at", "2024-01-26 09:55:02.457700"], ["id", 1]]
---
    def update
      @user_info = current_user.profile || current_user.build_profile

      if params[:user] && params[:user][:avatar].present?
        @user_info.avatar.attach(params[:user][:avatar])
      end

      if @user_info.update(user_params)