app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def resend_confirmation
      user = User.find_by(id: params[:user_id])

UPDATE "users" SET "updated_at" = ?, "address" = ? WHERE "users"."id" = ?  [["updated_at", "2024-01-24 07:19:35.901376"], ["address", "1221"], ["id", 4]]
---
    def update
        current_user.image.attach(params[:user][:avatar])
        if current_user.update(user_params)